// 1. Элсэлтийн ерөнхий шалгалтын (ЭЕШ) математикийн дүнг сурагчдын хувийн дугаараар нь жагсаан гаргасан байгаа. Өндөр оноотой сурагчдыг эхэнд нь жагсааж бич. Оноо тэнцсэн тохиолдолд хувийн дугаар багатайг нь эхэнд нь жагсаана. Сурагчдын хувийн дугаар 1, 2, 3, гэх мэтээр үргэлжлэн олгогдсон байгаа.  



// Input: Сурагчдын оноо хувийн дугаарын дагуу нэг багана үүсгэн жагссан байгаа.

// Мөр бүрт нэг сурагчийн оноо. Сурагчдын нийт тоо 1000-аас бага. Сурачдын оноо нь 0-оос 100 хүртэлх бүхэл тоогоор дүгнэгдэнэ.



// Output: Өндөр оноогоор нь нэг багана болгосон жагсаалт. Оноо тэнцсэн сурагчдын хувийн дугаар багатай нь эхэлж жагсана.



// Example

// Input:



// 40

// 50

// 92

// 50

// 40



// Output:



// 3

// 2

// 4

// 1

// 5